# Data Science Pandas - Joins, Time Series & Rolling Statistics, SQL

## Tasks Today:

1) <b>Pandas</b> <br>
 &nbsp;&nbsp;&nbsp;&nbsp; a) Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - merge() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Breaking Down the Inner Join <br>
 &nbsp;&nbsp;&nbsp;&nbsp; b) Outer Joins <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - Use Case Example <br>
 &nbsp;&nbsp;&nbsp;&nbsp; c) Rolling Statistics and Time Series w/Pandas <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - read_csv() <br>
 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; - shift() <br>
 2) <b> SQL </b> <br>
      - Adding DataFrame to Database Table
      - Reading SQL Query Result into DataFrame

In [1]:
import pandas as pd
import numpy as np

### Joins <br>
<p>Very often you will have to combine data from several different sources to obtain the actual dataset you need for your exploration or modeling. Pandas draws heavily on SQL in its API design for joins, and if you are familiar with SQL joins, then Pandas will come naturally. Imagine you have two tables, one with customer name and gender, and the other with their purchases:</p>

In [2]:
# Generate some fake data
city_data = {
    1: 'Chicago',
    2: 'Boston',
    3: 'New York',
    4: 'San Francisco',
    5: 'Washington D.C.'
}

ages = np.random.randint(18,65, 100)
city = [ city_data[num] for num in np.random.randint(1,6,100)]
customer_id = np.arange(1000,1100)

<p>Let's assume we have a dataset containing the customer ID's cities, and ages for a set of customers. Suppose further, that we have a second table, containing some customer ID's, and a feedback survey rating from those customers. Suppose finally, that you as an analyst are asked the following question: What city tends to give the best feedback for our product? We'll need a join operation to get the answer.</p>

In [3]:
customer_demographics = pd.DataFrame.from_dict({
    'ages': ages,
    'city': city,
    'customer_id': customer_id
})

customer_demographics

    ages             city  customer_id
0     64  Washington D.C.         1000
1     57  Washington D.C.         1001
2     26    San Francisco         1002
3     47         New York         1003
4     33           Boston         1004
..   ...              ...          ...
95    48    San Francisco         1095
96    61  Washington D.C.         1096
97    61           Boston         1097
98    21          Chicago         1098
99    58  Washington D.C.         1099

[100 rows x 3 columns]

In [4]:
# Generate some other fake data
customer_id = np.random.randint(1000,1200, 100)
customer_rating = np.random.randint(1,11,100)

surveys = pd.DataFrame.from_dict({
    'customer_id': customer_id,
    'customer_rating': customer_rating
})

surveys.head()

   customer_id  customer_rating
0         1030                2
1         1020                1
2         1126                3
3         1048                9
4         1189                7

##### merge()

<p>We can zip the two dataframes up with an inner join, using the Pandas API as follows:</p>

In [5]:
merged_results = customer_demographics.merge(surveys,
                                             on = 'customer_id', 
                                             how = 'inner').drop_duplicates('customer_id').reset_index(drop=True)
merged_results.head()

   ages             city  customer_id  customer_rating
0    64  Washington D.C.         1000                4
1    31    San Francisco         1006               10
2    38          Chicago         1007                9
3    36           Boston         1009                6
4    53  Washington D.C.         1014                6

In [38]:
# Merging 2 DF's together, dropping duplicates from fake data and setting an index on the merged column (customer_id)
merged_2 = customer_demographics.merge(surveys, 
                                       on='customer_id',
                                       how='inner').drop_duplicates('customer_id').set_index(['customer_id'])
merged_2

             ages             city  customer_rating
customer_id
1001           63    San Francisco                2
1009           24    San Francisco                2
1013           35           Boston                5
1014           38  Washington D.C.                2
1022           53           Boston                4
1025           58         New York               10
1027           45          Chicago                5
1028           29          Chicago                9
1031           37         New York                6
1033           24          Chicago                1
1034           20         New York                8
1036           59         New York                5
1037           45          Chicago                6
1039           57           Boston                7
1046           56         New York                7
1051           40          Chicago                3
1056           25  Washington D.C.                7
1057           51          Chicago                9
1060           48    San Francisco                6
1061           30          Chicago                7
1062           27    San Francisco                6
1063           59          Chicago                3
1064           26  Washington D.C.                5
1066           48          Chicago                3
1067           23           Boston                4
1069           51          Chicago                9
1070           60          Chicago                2
1071           25  Washington D.C.                4
1075           33    San Francisco                6
1076           52          Chicago                3
1077           43           Boston                1
1079           36    San Francisco                3
1080           51    San Francisco                8
1083           42    San Francisco                9
1091           42           Boston                9
1097           23          Chicago                5
1099           27    San Francisco                4

**.join() method**

In [6]:
demo_join = customer_demographics.join(other = surveys.set_index('customer_id'), on = 'customer_id', how = 'inner')
demo_join

no_dups = demo_join.drop_duplicates('customer_id').reset_index()
no_dups

    index  ages             city  customer_id  customer_rating
0       0    64  Washington D.C.         1000                4
1       6    31    San Francisco         1006               10
2       7    38          Chicago         1007                9
3       9    36           Boston         1009                6
4      14    53  Washington D.C.         1014                6
5      15    22    San Francisco         1015               10
6      16    23    San Francisco         1016                6
7      18    44           Boston         1018                8
8      20    52         New York         1020                1
9      25    61          Chicago         1025                3
10     26    30  Washington D.C.         1026                8
11     30    29         New York         1030                2
12     33    64           Boston         1033                6
13     35    22         New York         1035                1
14     36    40         New York         1036                8
15     37    58           Boston         1037                1
16     38    42    San Francisco         1038                5
17     40    36           Boston         1040                6
18     41    62          Chicago         1041                9
19     48    60  Washington D.C.         1048                9
20     56    28           Boston         1056                9
21     58    57  Washington D.C.         1058                6
22     61    62    San Francisco         1061                5
23     64    38  Washington D.C.         1064                2
24     66    50    San Francisco         1066                4
25     67    41  Washington D.C.         1067                8
26     70    51    San Francisco         1070                4
27     71    20           Boston         1071                1
28     75    35  Washington D.C.         1075               10
29     77    21           Boston         1077                2
30     79    59         New York         1079                4
31     80    58         New York         1080                7
32     83    27           Boston         1083                7
33     87    33           Boston         1087                5
34     88    39          Chicago         1088                8
35     89    32         New York         1089                3
36     90    31    San Francisco         1090                9
37     93    21         New York         1093                4
38     96    61  Washington D.C.         1096                5
39     97    61           Boston         1097                1
40     98    21          Chicago         1098                9
41     99    58  Washington D.C.         1099                3

<p>Now it's a simple groupby operation to reveal the answer:</p>

In [52]:
city_age_ratings = no_dups.groupby('city', as_index=False).mean().round(decimals = 2)[['city', 'ages','customer_rating']]
city_age_ratings

              city   ages  customer_rating
0           Boston  42.17             5.00
1          Chicago  42.85             5.00
2         New York  46.00             7.20
3    San Francisco  39.00             5.11
4  Washington D.C.  28.50             4.50

But what if we didn't drop the customer_id duplicates...would we get the same city result??

In [54]:
city_ar_dups = demo_join.groupby('city', as_index = False).mean().round(decimals = 2)[['city','ages','customer_rating']]
city_ar_dups

              city   ages  customer_rating
0           Boston  44.29             5.29
1          Chicago  43.56             4.75
2         New York  47.67             6.83
3    San Francisco  38.60             5.00
4  Washington D.C.  30.40             4.00

What would be the total mean for the US customers?

In [63]:
no_dups['country'] = 'USA'
no_dups.groupby('country').mean().astype(int)[['ages','customer_rating']]

         ages  customer_rating
country
USA        40                5

##### Breaking Down the Inner Join <br>
<p>Let's take a closer look at the actual mechanics here however. There is some subtlety and nuance that is best understood by thinking of an inner join as two steps: a cartesian product, and then a filter. Observe the result of the following inner join:</p>

In [7]:
d = {
    'A':[1,2,3,4,2],
    'B': ['a','b','c','d','x']
}

df1 = pd.DataFrame.from_dict(d)
df1

   A  B
0  1  a
1  2  b
2  3  c
3  4  d
4  2  x

In [8]:
d2 = {
    'A': [1,2,6,2,2],
    'C': ['e','f','g','h','y']
}

df2 = pd.DataFrame.from_dict(d2)
df2

   A  C
0  1  e
1  2  f
2  6  g
3  2  h
4  2  y

In [9]:
df1.merge(df2, on = 'A', how='inner')

   A  B  C
0  1  a  e
1  2  b  f
2  2  b  h
3  2  b  y
4  2  x  f
5  2  x  h
6  2  x  y

<p>Somehow, we ended up with more rows in the result than either of the original tables! This is because we joined on a $\textit{non-unique index}$. The join starts by computing all the possible combinations of rows, and then filters them based on the condition. Because of the duplicates, multiple combinations of rows make it through!</p>

### Outer Joins <br>
<p>An $\textit{outer join}$ produces all of the rows from the left table, and joins whatever rows it can to the right table, filling anywhere it cant with NaN's or None values. Below is a brief example, and then we will discuss a possible use case for this type of join.</p>

In [10]:
df3 = pd.DataFrame.from_dict({
    'A':[1,2,3],
    'B': ['a','b','c']
})

df4 = pd.DataFrame.from_dict({
    'A': [1],
    'C': ['d']
})

In [11]:
df3

   A  B
0  1  a
1  2  b
2  3  c

In [12]:
df4

   A  C
0  1  d

In [13]:
df3.merge(df4, on='A', how = 'outer')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [14]:
# LEFT JOIN MERGE
df3.merge(df4, on='A', how='left')

   A  B    C
0  1  a    d
1  2  b  NaN
2  3  c  NaN

In [15]:
# RIGHT JOIN MERGE
df3.merge(df4, on='A', how='right')

   A  B  C
0  1  a  d

##### Use Case Example

<p>As an example use case, let's imagine we have again the demographics and survey response tables from above:</p>

In [17]:
customer_demographics

    ages             city  customer_id
0     64  Washington D.C.         1000
1     57  Washington D.C.         1001
2     26    San Francisco         1002
3     47         New York         1003
4     33           Boston         1004
..   ...              ...          ...
95    48    San Francisco         1095
96    61  Washington D.C.         1096
97    61           Boston         1097
98    21          Chicago         1098
99    58  Washington D.C.         1099

[100 rows x 3 columns]

In [18]:
surveys.head()

   customer_id  customer_rating
0         1030                2
1         1020                1
2         1126                3
3         1048                9
4         1189                7

<p>Now, you are asked as an analyst to compare the demographics of survey responders to the demographics of all your customers combined.</p>

In [22]:
demo_ratings_outer = customer_demographics.merge(surveys, on='customer_id', how='outer').drop_duplicates('customer_id')

demo_ratings_outer['customer_rating'] = demo_ratings_outer['customer_rating'].fillna('N/A')
demo_ratings_outer

     ages             city  customer_id customer_rating
0    64.0  Washington D.C.         1000               4
1    57.0  Washington D.C.         1001             N/A
2    26.0    San Francisco         1002             N/A
3    47.0         New York         1003             N/A
4    33.0           Boston         1004             N/A
..    ...              ...          ...             ...
153   NaN              NaN         1193               7
154   NaN              NaN         1184               9
155   NaN              NaN         1107               4
156   NaN              NaN         1121               2
157   NaN              NaN         1108               5

[138 rows x 4 columns]

In [23]:
# Count all survey responders against the total number of customers we have 
# (Specifically the customers that haven't taken the survey yet)

#demo_size = demo_ratings_outer.groupby(['city','customer_rating']).count()

# Getting the total number of survey respondents by filtering out n/a values
answered_surveys = demo_ratings_outer[demo_ratings_outer['customer_rating'] != 'N/A'].count()
total_surveys = answered_surveys.customer_rating

#getting the total number of customerid's associated with both tables regardless of survey/demo participation
total_customers = demo_ratings_outer.count().customer_id
total_customers


print(f'Our records show that only {((total_surveys/total_customers)*100).round()}% of our customers have completed this survey!')

Our records show that only 58.0% of our customers have completed this survey!

In [46]:
# average age of people that answered the survey
new_survey_df = demo_ratings_outer[demo_ratings_outer['customer_rating'] != 'N/A'].reset_index()
new_survey_df['ages'] = new_survey_df['ages'].fillna('N/A')

new_survey_df[new_survey_df['ages'] != 'N/A'].mean()

index                58.833333
ages                 42.166667
customer_id        1053.285714
customer_rating       5.571429
dtype: float64

In [49]:
# find the average age of people that did not answer the survey
survey_non_answer = demo_ratings_outer[demo_ratings_outer['customer_rating'] == 'N/A']['ages'].mean()

survey_non_answer

41.793103448275865

### Rolling Statistics and Time Series with Pandas

##### read_csv()

In [50]:
weather = pd.read_csv('../files/chiweather.csv', sep = ';')

In [56]:
weather

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd]
0,2017,11,25,0,0,51.85,0.0,17.31,327.13
1,2017,11,25,1,0,49.14,0.0,20.53,330.64
2,2017,11,25,2,0,46.42,0.0,21.41,327.80
3,2017,11,25,3,0,44.13,0.0,21.79,324.19
4,2017,11,25,4,0,42.22,0.0,21.03,321.91
...,...,...,...,...,...,...,...,...,...
187,2017,12,2,19,0,50.36,0.0,6.27,235.18
188,2017,12,2,20,0,49.33,0.0,6.50,243.43
189,2017,12,2,21,0,48.29,0.0,6.37,251.57
190,2017,12,2,22,0,47.16,0.0,6.11,261.57
191,2017,12,2,23,0,45.75,0.0,5.82,270.00

In [58]:
weather_update = weather.groupby(['Year','Month','Day']).mean()

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]
Year Month Day
2017 11    25                         325.761667
           26                         258.533750
           27                         188.377083
           28                         244.673333
           29                         167.510000
           30                         276.060000
     12    1                          223.459583
           2                          218.252500

In [60]:
weather_update.head()

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083

                Wind direction  [10 m above gnd]
Year Month Day
2017 11    25                         325.761667
           26                         258.533750
           27                         188.377083
           28                         244.673333
           29                         167.510000

##### shift() <br>
<p>Shift index by desired number of periods with an optional time freq</p>

In [61]:
# Print all keys for easier use
print(weather_update.keys())

Index(['Hour', 'Minute', 'Temperature  [2 m above gnd]',
       'Total Precipitation  [sfc]', 'Wind speed  [10 m above gnd]',
       'Wind direction  [10 m above gnd]'],
      dtype='object')

In [76]:
#create a new column to refelct the previous days temperatures....
# We can do this by making a copy of temps, appending it onto our dataFrame, and shifting all values down
# by one idex

weather_update['last_temp'] = weather_update['Temperature  [2 m above gnd]'].shift(1)
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference
Year Month Day
2017 11    25                         325.761667        NaN         NaN
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

In [78]:
# create a new column that takes the difference in temperature from the previous day as an absolute value
weather_update['difference'] = abs(weather_update['Temperature  [2 m above gnd]'] - weather_update['last_temp'])
weather_update

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference
Year Month Day
2017 11    25                         325.761667        NaN         NaN
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

In [90]:
from statistics import mean
#Adding in temp from 2 days ago to calcultae rolling 3 day avg
weather_update['last_temp_2'] = weather_update['Temperature  [2 m above gnd]'].shift(2)
weather_update

# caluclating average temp over last 3 days
weather_update['r_3d_average'] = (weather_update['Temperature  [2 m above gnd]'] + weather_update['last_temp'] + weather_update['last_temp_2'])/3

In [92]:
# Pip install for both psycopg2 and SQLAlchemy
import sys
!{sys.executable} -m pip install psycopg2-binary SQLAlchemy

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/lib/python3.7/site-packages (2.8.6)
Requirement already satisfied: SQLAlchemy in /opt/anaconda3/lib/python3.7/site-packages (1.3.23)

In [93]:
# databaselanguage(postgresql)://user:password@url:port/database_name
connection = 'postgresql://postgres:PASSWORD@127.0.0.1:5432/chiweather'

weather_update['last_temp'] = weather_update['last_temp'].fillna(float(0))

In [107]:
weather_update['difference'] = weather_update['difference'].fillna(float(0))
new = weather_update.drop(labels='last_temp_2',axis=1)
final_weather = new.drop(labels='r_3d_average', axis=1)
final_weather

                Hour  Minute  Temperature  [2 m above gnd]  \
Year Month Day
2017 11    25   11.5     0.0                     41.208750
           26   11.5     0.0                     38.298333
           27   11.5     0.0                     45.611250
           28   11.5     0.0                     48.497500
           29   11.5     0.0                     40.122917
           30   11.5     0.0                     43.618750
     12    1    11.5     0.0                     41.860417
           2    11.5     0.0                     45.324167

                Total Precipitation  [sfc]  Wind speed  [10 m above gnd]  \
Year Month Day
2017 11    25                     0.000000                     17.939583
           26                     0.000000                     11.435417
           27                     0.000000                     11.082500
           28                     0.000000                     17.418750
           29                     0.020833                     13.107083
           30                     0.033333                     14.343333
     12    1                      0.000000                      6.845000
           2                      0.000000                      8.934167

                Wind direction  [10 m above gnd]  last_temp  difference
Year Month Day
2017 11    25                         325.761667   0.000000    0.000000
           26                         258.533750  41.208750    2.910417
           27                         188.377083  38.298333    7.312917
           28                         244.673333  45.611250    2.886250
           29                         167.510000  48.497500    8.374583
           30                         276.060000  40.122917    3.495833
     12    1                          223.459583  43.618750    1.758333
           2                          218.252500  41.860417    3.463750

In [110]:
# Writing a DataFrame to PostGreSQL database 
# from sqlalchemy.types import Integer, Text,String,DateTime,Float
from sqlalchemy.types import Integer, Text, String, DateTime, Float

final_weather.to_sql('chicago-weather', index=True, con = connection, if_exists = 'append',
                     schema = 'public', chunksize = 500, dtype = {
                         'year': String,
                         'month': String,
                         'day': String,
                         'minute': String,
                         'Temperature  [2 m above gnd]': Float,
                         'Total Precipitation  [sfc]': Float ,
                         'Wind speed  [10 m above gnd]': Float ,
                         'Wind direction  [10 m above gnd]': Float ,
                         'last_temp': Float,
                         'difference': Float
                     })

In [111]:
# READING SQL DATA
chicago_weather_sql = pd.read_sql_table('chicago-weather', con = connection)

chicago_weather_sql

,Year,Month,Day,Hour,Minute,Temperature [2 m above gnd],Total Precipitation [sfc],Wind speed [10 m above gnd],Wind direction [10 m above gnd],last_temp,difference
0,2017,11,25,11.5,0.0,41.208750,0.000000,17.939583,325.761667,0.000000,0.000000
1,2017,11,26,11.5,0.0,38.298333,0.000000,11.435417,258.533750,41.208750,2.910417
2,2017,11,27,11.5,0.0,45.611250,0.000000,11.082500,188.377083,38.298333,7.312917
3,2017,11,28,11.5,0.0,48.497500,0.000000,17.418750,244.673333,45.611250,2.886250
4,2017,11,29,11.5,0.0,40.122917,0.020833,13.107083,167.510000,48.497500,8.374583
5,2017,11,30,11.5,0.0,43.618750,0.033333,14.343333,276.060000,40.122917,3.495833
6,2017,12,1,11.5,0.0,41.860417,0.000000,6.845000,223.459583,43.618750,1.758333
7,2017,12,2,11.5,0.0,45.324167,0.000000,8.934167,218.252500,41.860417,3.463750

In [112]:
connection = 'postgresql://postgres:PASSWORD@127.0.0.1:5432/dvd-rental-operators'
dvd_rental = pd.read_sql_table('actor', con=connection)
dvd_rental

     actor_id first_name     last_name             last_update
0           1   Penelope       Guiness 2013-05-26 14:47:57.620
1           2       Nick      Wahlberg 2013-05-26 14:47:57.620
2           3         Ed         Chase 2013-05-26 14:47:57.620
3           4   Jennifer         Davis 2013-05-26 14:47:57.620
4           5     Johnny  Lollobrigida 2013-05-26 14:47:57.620
..        ...        ...           ...                     ...
195       196       Bela        Walken 2013-05-26 14:47:57.620
196       197      Reese          West 2013-05-26 14:47:57.620
197       198       Mary        Keitel 2013-05-26 14:47:57.620
198       199      Julia       Fawcett 2013-05-26 14:47:57.620
199       200      Thora        Temple 2013-05-26 14:47:57.620

[200 rows x 4 columns]